In [1]:
import numpy as np
from pandas import Series, DataFrame

import pandas as pd
from numpy.random import randn

In [3]:
ser1 = Series([1,2,3,4],index = ['A','B','C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [8]:
ser2 = ser1.reindex(['A','B','C','D','E','F'])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [6]:
ser2.reindex(['A','B','C','D','E','F','G'],fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [9]:
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])

In [10]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [11]:
ranger = range(15)
ranger

range(0, 15)

In [12]:
ser3.reindex(ranger,method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [15]:
dframe = DataFrame(randn(25).reshape((5,5)),index =  ['A','B','C','D','F'],columns=['col1','col2','col3','col4','col5'])

In [16]:
dframe

       col1      col2      col3      col4      col5
A  0.053828 -0.975397  0.902763  0.992215  0.178635
B  0.102888 -0.787861 -0.706219  1.270673 -0.021421
C  1.001222 -1.025548  0.821914 -1.633268  0.816291
D -1.009280 -0.395015 -1.424636 -0.144476 -0.879238
F  0.512100  0.259092  1.402387  0.170172 -0.248153

In [18]:
dframe2 = dframe.reindex(['A','B','C','D','E','F'])
dframe2

       col1      col2      col3      col4      col5
A  0.053828 -0.975397  0.902763  0.992215  0.178635
B  0.102888 -0.787861 -0.706219  1.270673 -0.021421
C  1.001222 -1.025548  0.821914 -1.633268  0.816291
D -1.009280 -0.395015 -1.424636 -0.144476 -0.879238
E       NaN       NaN       NaN       NaN       NaN
F  0.512100  0.259092  1.402387  0.170172 -0.248153

In [19]:
new_columns = ['col1','col2','col3','col4','col5','col6']

In [20]:
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A  0.053828 -0.975397  0.902763  0.992215  0.178635   NaN
B  0.102888 -0.787861 -0.706219  1.270673 -0.021421   NaN
C  1.001222 -1.025548  0.821914 -1.633268  0.816291   NaN
D -1.009280 -0.395015 -1.424636 -0.144476 -0.879238   NaN
E       NaN       NaN       NaN       NaN       NaN   NaN
F  0.512100  0.259092  1.402387  0.170172 -0.248153   NaN